In [1]:
import pandas as pd
import numpy as np
from function import *
from datetime import datetime
from RecommendationModel import RecommenderNet
import warningsimport os
import pymysql
import mysql.connector
import pandas as pd
import numpy as np
from datetime import date, timedelta
import tensorflow as tf
from tensorflow import keras
from RecommendationModel import RecommenderNet
warnings.filterwarnings('ignore')

In [2]:
ranting_fe=get_DataRating().copy()
rating=ranting_fe[['kode_user','kode_wisata','rate_value']]
rating.columns = [['id_user','id_wisata', 'rating']]
rating.to_csv('Dataset/rating_fe.csv', index=False)
        
list_wisata=get_DataListWisata().copy()
place=list_wisata[['id_wisata','wisata']]
place.columns = ['id','place_name']
place.to_csv('Dataset/list_wisata_db.csv', index=False)

rating = pd.read_csv('Dataset/rating_fe.csv')
place = pd.read_csv('Dataset/list_wisata_db.csv')
df=rating.copy()
#training(df)
#testing

In [3]:
ranting_fe.set_index("time", inplace=True)
#getdatetoday
today = date.today()
today=today.strftime('%Y-%m-%d')
test=ranting_fe.loc[today]
test=test.iloc[:, 1:2]
test=test.reset_index(drop=True)
test=test.kode_user.unique()

In [4]:
for i in test:
    test=pd.DataFrame([i], columns=['id_user'])
    df=rating.copy()
    place_df=place.copy()
    result=testing(test, df, place_df)
    rp2= result.copy()
    test = test.id_user.iloc[0]
    kode_user=[]
    for i in range(len(rp2)):
        kode_user.append(test)
    rp2['kode_user'] = kode_user
    rp2['id_rek'] = ""
    rp2 = rp2[["id_rek", "kode_user", "id"]]
    rp2.columns = ["id_rek", "kode_user", "kode_wisata"]
    delete_list_rekomen(test)
    #insert_to_list_rekomen_db(rp2)

WARNING:tensorflow:Detecting that an object or model or tf.train.Checkpoint is being deleted with unrestored values. See the following logs for the specific values in question. To silence these warnings, use `status.expect_partial()`. See https://www.tensorflow.org/api_docs/python/tf/train/Checkpoint#restorefor details about the status object returned by the restore function.
WARNING:tensorflow:Value in checkpoint could not be found in the restored object: (root).user_embedding.embeddings
WARNING:tensorflow:Value in checkpoint could not be found in the restored object: (root).user_bias.embeddings
WARNING:tensorflow:Value in checkpoint could not be found in the restored object: (root).places_embedding.embeddings
WARNING:tensorflow:Value in checkpoint could not be found in the restored object: (root).places_bias.embeddings
WARNING:tensorflow:Value in checkpoint could not be found in the restored object: (root).optimizer.iter
WARNING:tensorflow:Value in checkpoint could not be found in the restored object: (root).optimizer.beta_1
WARNING:tensorflow:Value in checkpoint could not be found in the restored object: (root).optimizer.beta_2
WARNING:tensorflow:Value in checkpoint could not be found in the restored object: (root).optimizer.decay
WARNING:tensorflow:Value in checkpoint could not be found in the restored object: (root).optimizer.learning_rate
WARNING:tensorflow:Value in checkpoint could not be found in the restored object: (root).optimizer's state 'm' for (root).user_embedding.embeddings
WARNING:tensorflow:Value in checkpoint could not be found in the restored object: (root).optimizer's state 'm' for (root).user_bias.embeddings
WARNING:tensorflow:Value in checkpoint could not be found in the restored object: (root).optimizer's state 'm' for (root).places_embedding.embeddings
WARNING:tensorflow:Value in checkpoint could not be found in the restored object: (root).optimizer's state 'm' for (root).places_bias.embeddings
WARNING:tensorflow:Value in checkpoint could not be found in the restored object: (root).optimizer's state 'v' for (root).user_embedding.embeddings
WARNING:tensorflow:Value in checkpoint could not be found in the restored object: (root).optimizer's state 'v' for (root).user_bias.embeddings
WARNING:tensorflow:Value in checkpoint could not be found in the restored object: (root).optimizer's state 'v' for (root).places_embedding.embeddings
WARNING:tensorflow:Value in checkpoint could not be found in the restored object: (root).optimizer's state 'v' for (root).places_bias.embeddings

AttributeError: 'NoneType' object has no attribute 'copy'

In [9]:
ranting_fe=get_DataRating().copy()
ranting_fe.set_index("time", inplace=True)

In [10]:
ranting_fe

                     id_rate  kode_user  kode_wisata  rate_value
time
2022-10-19 14:49:21    20023       1004          101         4.0
2022-10-19 14:49:21    20024       1004          102         5.0
2022-10-19 14:49:21    20025       1004          103         4.0
2022-10-19 14:49:21    20026       1004          104         5.0
2022-10-19 14:49:21    20027       1004          105         3.0
...                      ...        ...          ...         ...
2022-11-02 13:29:45    20138       1014          107         4.5
2022-11-02 13:30:12    20139       1014          107         4.5
2022-11-02 13:45:42    20140       1014          107         4.5
2022-11-02 13:46:38    20141       1014          105         4.5
2022-11-02 14:04:37    20142       1014          105         4.5

[117 rows x 4 columns]

In [6]:
today = date.today()
today=today.strftime('%Y-%m-%d')
today

'2022-11-03'

In [12]:
test=ranting_fe.loc['2022-11-02']
test=test.iloc[:, 1:2]
test=test.reset_index(drop=True)
test=test.kode_user.unique()
test

array([1020, 1021, 1014], dtype=int64)

In [17]:
type(int(test[0]))

int

In [23]:
def delete_list_rekomen(test):
    # Connect to the database
    connection = pymysql.connect(host="127.0.0.1",
                                 port=3306,
                                 user='root',
                                 # password='f#Ur8J3N',
                                 database='tour_in')
    # create cursor
    cursor=connection.cursor()    
    cursor.execute("DELETE FROM `list_rekomen` WHERE `kode_user` = %s", (test))
    connection.commit()

In [24]:
for i in test:
    x=int(i)
    delete_list_rekomen(i)

In [8]:
x =[]

In [9]:
if x == []:
    print("x kosong")
else:
    print("tidak kosong")

x kosong

In [6]:
test=1014

In [ ]:
SELECT * FROM `rating_fe` WHERE `kode_user` = %s

In [16]:
x=get_DataRatingbyID(test)

DatabaseError: Execution failed on sql '
    SELECT * FROM `rating_fe` WHERE `kode_user` ={test};
    ': 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use near '}' at line 1

In [19]:
def get_DataRating():
    my_conn = mysql.connector.connect(host="127.0.0.1",
                                        port=3306,
                                        user='root',
                                        # password='f#Ur8J3N',
                                        database='tour_in')
    query_insert="""
    SELECT * FROM rating_fe;
    """
    raw_rating_fe = pd.read_sql_query(query_insert, my_conn)
    return raw_rating_fe

In [29]:
x=get_DataRating().copy()
x = x[["kode_user", "kode_wisata"]]

In [31]:
x=x[x['kode_user']==test]

In [34]:
x.kode_wisata.unique()

array([101, 108, 107, 105, 102, 103, 104, 106, 109, 110], dtype=int64)

In [46]:
import pandas as pd

kode_wisata={"kode_wisata":[101,102,103,104,105,106,107,108,109,110]}

In [47]:
df1 = pd.DataFrame(data = kode_wisata)

In [48]:
kode_user=[]
for i in range(len(df1)):
    kode_user.append(test)

In [49]:
df1['kode_user'] = kode_user

In [52]:
df1

   kode_wisata  kode_user
0          101       1014
1          102       1014
2          103       1014
3          104       1014
4          105       1014
5          106       1014
6          107       1014
7          108       1014
8          109       1014
9          110       1014

In [53]:
df1= df1[["kode_user","kode_wisata"]]

In [54]:
df1

   kode_user  kode_wisata
0       1014          101
1       1014          102
2       1014          103
3       1014          104
4       1014          105
5       1014          106
6       1014          107
7       1014          108
8       1014          109
9       1014          110